{
  "projects": {
    "samsungcnt": {
      "title": "삼성물산 상사부문",
      "desc": "심리스한 화면 전환",
      "role": ["프론트엔드 파트 리딩"],
      "client": "삼성물산",
      "h01": "심리스한 페이지 트랜지션",
      "p01": "개발 특이점으로는 메인과 주요 페이지인 비즈니스 소개 페이지 간의 심리스한 페이지 전환이었습니다. 백엔드 레거시인 Spring boot 위에 처리되어야 했기에 SPA 프레임워크를 사용할 수는 없었고 상태관리만 React로 하고 history API의 pushState와 popstate event listener를 통해 처리했습니다.",
      "p02": "비즈니스 소개 상세의 게이트와 같은 진입점 페이지가 있었는데 공통으로 사용하는 background image를 오버레이 해 두었습니다. 겹쳐놓은 이미지들을 마스킹해서 애니메이션을 구현했는데 데스크탑에선 별 문제가 없었지만 모바일에선 자꾸 페이지가 죽는 것이었습니다.",
      "p03": "해당 사항이 없는 부분은 display: none 처리해서 결국 해결했는데 페이지가 죽는 치명적인 오류가 나서 진땀나는 순간이었습니다. 모바일은 렌더링 최적화에 매우 예민하다는 것을 또 다시 확인하게 되었습니다."
    },
    "kodex": {
      "title": "삼성자산운용",
      "desc": "데이터 기반 렌더링 역대급 프로젝트",
      "awards": ["2023 앤어워드 Grand Prix", "Web Award Korea 2023 최고대상"],
      "role": ["프론트엔드 파트 리딩"],
      "client": "삼성자산운용",
      "p01": "백엔드 팀과 연계하며 고객사 요건을 충족시키기 위해 Spring boot 위에 뷰 라이브러리 형태로 필요한 부분에 React를 사용하게 되었습니다. <br />단순 게시글 리스트류를 제외하면 데이터 연동을 위한 모든 부분은 React로 처리하게 되었습니다.",
      "h01": "메인 트랜지션",
      "p02": "etf/fund 2개의 도메인으로 나뉘어져 있어 메인 페이지가 2종이 있게 되었습니다.",
      "p03": "두 페이지간 클릭으로 인터랙티브하게 이동할 수 있도록 pushState를 사용하여 화면 전환을 했고 키비주얼의 카드는 디자인 가이드에 맞춰 타입 분류를 했습니다.",
      "h02": "상품 리스트 파라미터",
      "p04": "수 많은 파라미터를 API로 호출하여 알맞은 상품 데이터를 가져와 유려하게 상품 리스트를 렌더링하는 것은 이번 프로젝트의 핵심 기능 중 하나였습니다.",
      "p05": "필터 프로퍼티를 공용 state로 만들어 컴포넌트간 상호 공유하고 고도화 프로젝트인 active에선 <strong>zustand와 provider</strong>를 이용하여 필터 프로퍼티 묶음의 변화에 맞춰 컴포넌트들이 렌더링 되도록 만들었습니다.",
      "p06": "촉박한 일정 때문에 상품 모델의 interface 를 제대로 정의하지 못해 typescript의 장점을 십분 활용치 못한 점은 아쉬웠습니다.",
      "h03": "상품 컴포넌트/템플릿",
      "p07": "또 다른 핵심 기능인 상품 페이지의 컴포넌트/템플릿화 역시 React의 강력한 구조적 성능 덕을 톡톡히 봤습니다. 화면설계/디자인 컴포넌트에 맞춰 스무 개 가량의 컴포넌트를 만든 후 데이터와 상품 종류에 따라 조합하여 렌더링 했습니다."
    },
    "casscool": {
      "title": "카스 쿨/월드컵",
      "desc": "작지만 강한 미니 프로젝트",
      "role": ["UI 개발"],
      "client": "CASS",
      "h01": "온/오프라인 이벤트",
      "p01": "맥주 브랜드 카스에서 온/오프라인 이벤트를 위해 모바일 페이지를 만들었습니다. 정해진 오프라인 행사에 맞춰진 프로젝트여서 빠른 시간에 완성을 하기 위해 react 를 사용했습니다.",
      "p02": "모바일 위주의 페이지여서 작업하는데는 수월한 편이었습니다. 많이 사용한 패턴인 유려한 영상 위에 UI를 배치하여 레이어 배치를 통해 유지보수가 용이하도록 정의했습니다."
    },
    "lotteshopping": {
      "title": "롯데백화점 웹 메인",
      "desc": "Vanilla 상태 관리로 유려한 UI",
      "role": ["Web 메인 개발"],
      "client": "롯데백화점",
      "h01": "메인 상태 관리",
      "p01": "복잡도가 높은 메인페이지를 별도의 라이브러리 없이 처리하였습니다. 중간에 fixed 로 고정되거나 오브젝트들이 역방향으로 스크롤 되고 또 상태에 따라 다시 페이지 스크롤로 복귀되는 등 유연한 뷰 상태를 정의했습니다.",
      "p02": "중간 영역에 진입 시 타이머와 플래그 등 여러 변수를 통해 안정적으로 상태를 관리하였습니다."
    },
    "hanwhadefense": {
      "title": "한화에어로스페이스 버츄얼 쇼룸",
      "desc": "WebGL 3D 모델 핸들링",
      "awards": ["2023 앤어워드 과학기술정보통신부 장관상"],
      "role": ["프론트엔드 파트 리딩"],
      "client": "한화에어로스페이스",
      "h01": "WebGL 3D 모델 핸들링",
      "p01": "그 동안 개인 작업으로 3D 모델을 만져본 적은 많았지만 이렇게 본격적으로 실무 프로젝트를 경험해 보니 감회가 새로웠습니다.",
      "p02": "이전 한국타이어 때의 3D 모델이 비교적 경량의 단순한 모델이었던 반면 이 쇼룸은 모델도 많아지고 그에 따른 요건이 조금 더 복잡해져 이전보다 더 많은 챌린지가 있었습니다.",
      "p03": "포인트 클릭, UI 연동을 넘어 에셋의 분할 로드, 뷰 전환, 조명, 애니메이션, 스프라이트 처리 등 꽤 다양한 3D 기술과 UI 기법을 적용할 수 있었던 알찬 프로젝트 였습니다!"
    },
    "hankooktire": {
      "title": "한국타이어 글로벌/세일즈 플랫폼",
      "desc": "수 많은 컴포넌트와 템플릿 관리",
      "awards": ["Web Award Korea 2022 제조업분야 대상", "2022 앤어워드 Grand Prix", "iF DESIGN AWARD 2023 Winner", "Red Dot Design Award 2023 Winner"],
      "role": ["프론트엔드 파트 리딩"],
      "client": "한국타이어",
      "h01": "한국타이어 글로벌/세일즈 플랫폼",
      "p01": "한국타이어 프로젝트는 브랜드 중심의 글로벌과 제품 중심의 세일즈 플랫폼으로 나뉘어져 많은 기간과 인원이 들어간 대형 프로젝트였습니다.",
      "p02": "이 프로젝트에서 저의 역할과 책임은 대량의 페이지를 관리하기 위해 AEM 컴포넌트를 설계하는 것과 이를 빌딩할 프론트엔드 빌드 시스템을 개발하는 것, 그리고 외부 인력들을 확충하고 교육하는 것이었습니다.",
      "p03": "Inside Hankook, technoring 같은 비주얼 특화 페이지 개발도 빼놓을 수 없는 역할 이었습니다. 양적/질적으로 챌린지 된 순간들이 많았기에 상당히 어려웠던 프로젝트로 기억에 남습니다.",
      "p04": "하지만 라이브러리의 도움을 최소화한 컴포넌트 시스템을 설계하고 외부 협력사와 커뮤니케이션하며 개발을 조율했던 점. 퍼블리싱 외부 인력팀 빌딩과 교육. WebGL 실무를 경험했던 점 등 수상을 제외하고도 매우 큰 성과가 있었던 프로젝트였습니다.",
      "p05": "운영 중에는 CDN 퍼포먼스 이슈가 있어 이미지 시퀀스를 사용했던 페이지들에 큰 문제가 생겼습니다. CDN 리소스 로드 퍼포먼스는 프론트엔드에서 어떻게 할 수 없는 문제지만 로딩을 분할해서 40%만 로딩했을 때 완료로 처리하고 사용자가 스크롤을 내리는 중 나머지가 모두 로드되는 시간을 벌도록 아이디어를 냈습니다. 나머지 60%는 로드되는 순서도 중요하다 판단되어 generator 를 사용해 로드 프로미스를 동기적으로 처리했습니다."
    },
    "iconic20": {
      "title": "스마일게이트 아이코닉20",
      "desc": "모션그래픽 수준의 비주얼",
      "awards": ["2022 앤어워드 Grand Prix"],
      "role": ["UI 개발"],
      "bracket": "(현재 메인으로 리다이렉팅 되는 경우가 있는데 한 번 더 링크 이동해주세요🙏)",
      "client": "스마일게이트",
      "h01": "인터랙티브 비주얼",
      "p01": "원래 스마일게이트의 TF는 아니었지만 아이코닉20 페이지 시안 영상을 봤을 때, 도전해 보고 싶은 열망이 생겼습니다.<br /> 카드의 일그러진 움직임과 연출이 WebGL, Shader를 사용해야 했고 제가 그린 기술 로드맵의 이정표였기 때문입니다.",
      "p02": "개인 프로젝트가 아니었기 때문에 shader 효과의 피저빌리티 체크를 한 뒤 디자이너/기획자와 공유한 후 해봐도 좋을 것 같다는 피드백을 받았습니다.",
      "p03": "Shader와 디스토션 효과 보다 20도 정도 기울여져 있는 레이아웃 특징때문에 굉장히 애먹었습니다. ",
      "p04": "HTML 구조라면 쉽게 될 부분도 웹지엘 공간으로 옮기는 것이 쉽지 않았는데 HTML로 레이아웃을 구성하고 이를 가져와 웹지엘 좌표계로 변환하여 카드 오브젝트를 배치했습니다.",
      "p05": "리스트 - 상세로 이동할 때 카드의 로테이션 계산이 생각보다 어려웠는데, 기울어져 있는 부분이 카드 리스트 기준이어서 카드와 상위 컨테이너들의 좌표/기울기까지 계산에 넣어야 의도대로 동작했습니다.",
      "p06": "상세에서 리스트로 되돌아 가는 것도 역시나 쉽지 않았습니다. 기억해야 할 값들이 대단히 복잡해서 너무 힘들었습니다. 마지막 알고리즘이 풀리고 모든게 해결되었을 때 너무 기쁜 나머지 새벽 3시가 되었는데도 집에 갈 택시를 바로 잡지 않고, 회사 앞 경의선 숲길을 춤추며 걸어갔던 기억이 납니다 :)"
    },
    "galaxystudio": {
      "title": "삼성 내 손안에 갤럭시 스튜디오",
      "desc": "긴박했지만 안정적인 론칭",
      "role": ["UI 개발"],
      "client": "삼성전자"
    },
    "bespoke": {
      "title": "삼성 비스포크 나답게 집꾸",
      "desc": "모듈 조합 마이크로 UX",
      "role": ["UI 개발"],
      "client": "삼성전자",
      "awards": ["Red Dot Design Award 2022"]
    },
    "kia-worldwide": {
      "title": "기아 브랜드 글로벌 쇼케이스",
      "desc": "기아의 환골탈태 브랜드 리론칭",
      "client": "기아",
      "role": ["프론트엔드 리드"],
      "awards": ["Web Award Korea 2022 최고대상😁"],
      "h01": "브랜드 리론칭",
      "p01": "기아자동차는 2021년을 맞이하여 기아로 사명을 바꾸며 CI와 BI의 변경을 비롯하여 브랜드의 대대적인 리론칭을 시작했습니다. 이를 구체화하는 단계에서 동적으로 콘텐츠를 보여주는 쇼케이스 웹사이트가 요구 사항으로 나오게 되었습니다.",
      "p02": "가장 처음 만들어진 페이지는 이벤트 D-day의 해당 시간까지 카운트다운을 보여주고 시간이 되면 쇼케이스로 전환되어 콘텐츠를 볼 수 있는 페이지였습니다. 모두 한 페이지에서 말이죠.",
      "c01": "파티클 모션은 이벤트 시간이 지나가는 찰나의 시간에만 볼 수 있는 비운의 인터랙션이었다..",
      "h02": "파티클 인터랙션",
      "p03": "이벤트 시간이 되서 쇼케이스 콘텐츠로 전환될 때 원형 오브젝트가 터지는 파티클 모션을 보여줍니다. 원형 오브젝트가 파티클로 사라지는 모션은 기존 기아 로고를 둘러싸고 있던 원형 오브젝트가 사라지며 새 로고가 만들어지는 것을 의미했습니다.(물론 제 의도는 아니었구요..)",
      "p04": "파티클 인터랙션은 canvas 엘리먼트로 구현되어 있습니다. 구형 디바이스에서도 쾌적하게 모션이 되도록 테스트를 거쳐 2000개의 파티클 갯수를 정했는데, 시간이 되면 정해진 범위 내에서 랜덤하게 생성 후 간단한 물리 연산을 통해 퍼지며 사라집니다.",
      "p05": "렌더링 루프 안에서 파티클 각각은 등가속도 회전 운동을 위한 가속도와 질량을 가집니다. 이 갱신된 값을 토대로 cos, sin 함수를 이용해 파티클은 조금씩 움직이게 되죠. 여기에 감속을 위한 댐핑 상수를 가속도에 더해주면 그럴듯한 파티클 움직임이 나옵니다.",
      "p06": "이후에도 이벤트 스케줄에 따라 페이지들이 추가되며 기아의 브랜드 콘셉트를 보여주는 웹사이트는 변화해 갔습니다. 앞선 페이지처럼 동적으로 변화하는 것은 아니지만요.",
      "p07": "페이지 수는 적었는데 어째 들어간 디자인 요소들이나 모션도 많고 요구 사항도 정신없이 들어와서 고생했던 프로젝트였습니다.",
      "p08": "영감을 주는 움직임(movement that inspires)이라는 브랜드 슬로건을 작업을 하며 저도 영감을 얻고자 이직이라는 움직임을 준비하게 되었죠..",
      "p09": "물론 농담입니다 ㅎㅎ :)"
    },
    "fujifilm": {
      "title": "후지필름",
      "desc": "캔버스 엘리먼트를 처음 적용해 본 프로젝트",
      "client": "후지필름",
      "role": ["UI 개발"]
    },
    "laneige": {
      "title": "라네즈",
      "desc": "3개국 언어로 구축된 아모레 퍼시픽의 글로벌 뷰티 웹사이트",
      "client": "아모레퍼시픽",
      "role": ["UI 개발"],
      "strikeThrough": "(리뉴얼 되었습니다)"
    },
    "galleria": {
      "title": "Hanwha Galleria",
      "desc": "방대한 통합 사이트 그리고 첫 PL 역할",
      "client": "한화 갤러리아",
      "awards": ["Web Award Korea 2019 최우수상"],
      "role": ["UI 개발"]
    },
    "vyvydstudio": {
      "title": "비비드 스튜디오",
      "desc": "밀레니얼 인싸들을 위한 코스메틱 브랜드",
      "client": "비비드웍스",
      "awards": ["Web Award Korea 2019 최우수상"],
      "role": ["UI 개발"],
      "strikeThrough": "(폐쇄되었습니다ㅠㅠ)"
    },
    "continuous-award-winning": {
      "title": "웹어워드 코리아 2년 연속 최고대상",
      "client": "삼성자산운용, 기아",
      "desc": "",
      "role": ["UI 개발"],
      "p01": "제가 참여하고 진행한 프로젝트가 대한민국 최고 권위의 웹 어워드 중 하나인 웹어워드 코리아(일명 i-awards)에서 2022년, 2023년 연속으로 최종 우승을 차지했습니다!",
      "p02": "삼성펀드는 React를 이용해 수많은 데이터를 아름다운 시각화로 보여주었습니다. <br/>기아월드와이드는 여러 프론트엔드 스택을 통해 새로운 컨셉의 디자인을 선보였습니다.",
      "p03": "저는 믿을 수 없을만큼 창의적인 사람들과 함께 일할 수 있는 행운을 얻었습니다! 감사합니다. 😄"
    }
  }
}