{
  "projects": {
    "samsungcnt": {
      "title": "Samsung C&T Trading & Investment Group",
      "desc": "Seamless screen transitions",
      "role": ["Front-end part leader"],
      "client": "Samsung C&T",
      "h01": "Seamless page transitions",
      "p01": "A unique feature of the development was the seamless page transition between the main page and the business introduction page, which is the main page. Because it had to be processed on top of the backend legacy Spring boot, the SPA framework could not be used, and only state management was done with React and processed through the history API's pushState and popstate event listener.",
      "p02": "There was an entry point page like the gate for business introduction details, and a commonly used background image was overlaid. I created an animation by masking the overlapping images, and there was no problem on the desktop, but the page kept crashing on mobile.",
      "p03": "I eventually solved the problem by handling display: none for the parts that didn't apply, but it was a frustrating moment when a fatal error occurred that caused the page to crash. I once again confirmed that mobile devices are very sensitive to rendering optimization."
    },
    "kodex": {
      "title": "Samsung Asset Management",
      "desc": "The best data-driven rendering project ever",
      "awards": ["2023 A.N.D Award Grand Prix", "Web Award Korea 2023 Best Grand Prize😁"],
      "role": ["Front-end part leader"],
      "client": "Samsung Asset Management",
      "p01": "In order to connect with the backend team and meet customer requirements, React was used in the necessary parts in the form of a view library on top of Spring boot. <br />Except for simple post lists, all parts for data integration were handled with React.",
      "h01": "Main transition",
      "p02": "ETF/Fund is divided into two domains, so there are two main pages.",
      "p03": "To enable users to interactively move between two pages by clicking, the screen was switched using pushState, and the cards in Key Visual were classified according to the design guide.",
      "h02": "Product list parameters",
      "p04": "One of the key features of this project was to retrieve appropriate product data by calling numerous parameters through the API and elegantly render the product list.",
      "p05": "Filter properties were made into a common state to be shared between components, and in active, an advancement project, <strong>zustand and provider</strong> were used to make components render according to changes in the filter property bundle.",
      "p06": "Due to the tight schedule, we were unable to properly define the interface of the product model, so it was unfortunate that we were unable to take full advantage of typescript.",
      "h03": "Product component/template",
      "p07": "Another key feature, componentization/templating of product pages, also benefited from React's strong structural capabilities. I created about 20 components according to the previous screen design/design components and then combined them and rendered them according to the data and product type."
    },
    "casscool": {
      "title": "Cassool/World Cup",
      "desc": "Small but powerful mini project",
      "role": ["UI Development"],
      "client": "CASS",
      "h01": "On/offline events",
      "p01": "Beer brand Cass has created a mobile page for online and offline events. Since this was a project tailored to a designated offline event so tight, I used react to complete it quickly.",
      "p02": "It was easy to work with because it was a mobile-oriented page. It is a familiar work pattern that places UI on top of video elements, and was defined for ease of maintenance through layer placement."
    },
    "lotteshopping": {
      "title": "Lotte Department Store (Web Main)",
      "desc": "Stylish UI with vanilla state management",
      "role": ["Web main development"],
      "client": "Lotte Department Store",
      "h01": "Main state management",
      "p01": "The highly complex main page was processed without a separate library. Flexible view states were defined, such as being fixed when entering middle area, returning to page scrolling when objects scrolling backwards depending on the state.",
      "p02": "When entering the intermediate area, the state was managed stably through various variables such as timers and flags."
    },
    "hanwhadefense": {
      "title": "Hanwha Defense (Aerospace) Virtual Showroom",
      "desc": "Handling WebGL 3D models",
      "awards": ["2023 A.N.D Award Minister of Science and ICT Award"],
      "role": ["Front-end part leader"],
      "client": "Hanwha Aerospace",
      "h01": "Handling WebGL 3D models",
      "p01": "I have often touched 3D models for personal work, but experiencing a full-scale practical project like this was a new experience.",
      "p02": "While the previous Hankook Tire 3D model was a relatively lightweight and simple model, this showroom had more models and the resulting requirements were a bit more complex, so there were more challenges than before.",
      "p03": "It was a fruitful project that allowed us to apply quite a variety of 3D technologies and UI techniques, such as split loading of assets, view switching, lighting, animation, and sprite processing, beyond point clicking and UI integration!"
    },
    "hankooktire": {
      "title": "Hankook Tire Global/Sales Platform",
      "desc": "Manage numerous components and templates",
      "awards": ["Web Award Korea 2022 Manufacturing Grand Prize", "2022 A.N.D Award Grand Prix", "iF DESIGN AWARD 2023 Winner", "Red Dot Design Award 2023 Winner"],
      "role": ["Front-end part leader"],
      "client": "Hankook Tire"
    },
    "iconic20": {
      "title": "Smilegate Iconic20",
      "desc": "Motion graphics-level visuals",
      "awards": ["2022 A.N.D Award Grand Prix"],
      "role": ["UI development"],
      "bracket": "(Currently, you may be redirected to the main page. Please go to the link one more time.🙏)",
      "client": "Smilegate"
    },
    "galaxystudio": {
      "title": "Samsung Galaxy Studio in my hand",
      "desc": "A tense but stable launch",
      "role": ["UI development"],
      "client": "Samsung"
    },
    "bespoke": {
      "title": "Samsung Bespoke, Be my own way",
      "desc": "Module Combination Micro UX",
      "role": ["UI development"],
      "client": "Samsung",
      "awards": ["Red Dot Design Award 2022"]
    },
    "kia-worldwide": {
      "title": "Kia Brand Global Showcase",
      "desc": "Kia’s transformational brand relaunch",
      "client": "Kia",
      "role": ["Front-end part leader"],
      "awards": ["Web Award Korea 2022 final winner😁"]
    },
    "fujifilm": {
      "title": "Fujifilm",
      "desc": "Project where I applied the canvas element for the first time",
      "client": "Fujifilm",
      "role": ["UI development"]
    },
    "laneige": {
      "title": "Laneige",
      "desc": "Amore Pacific's global beauty website built in three languages",
      "client": "Amore Pacific",
      "role": ["UI development"],
      "strikeThrough": "(It has been renewed)"
    },
    "galleria": {
      "title": "Hanwha Galleria",
      "desc": "Massive integrated site and first PL role",
      "client": "Hanwha Galleria",
      "awards": ["Web Award Korea 2019 Grand Prize"],
      "role": ["UI development"]
    },
    "vyvydstudio": {
      "title": "VYVYD STUDIO",
      "desc": "Cosmetic brand for millennial insiders",
      "client": "Vyvydworks",
      "awards": ["Web Award Korea 2019 Grand Prize"],
      "role": ["UI development"],
      "strikeThrough": "(It's closed T.T)"
    }
  }
}
