{
  "projects": {
    "samsungcnt": {
      "title": "Samsung C&T",
      "desc": "Seamless screen transitions",
      "role": ["Front-end part leader"],
      "client": "Samsung C&T",
      "h01": "Seamless page transitions",
      "p01": "A unique feature of the development was the seamless page transition between the main page and the business introduction page, which is the main page. Because it had to be processed on top of the backend legacy Spring boot, the SPA framework could not be used, and only state management was done with React and processed through the history API's pushState and popstate event listener.",
      "p02": "There was an entry point page like the gate for business introduction details, and a commonly used background image was overlaid. I created an animation by masking the overlapping images, and there was no problem on the desktop, but the page kept crashing on mobile.",
      "p03": "I eventually solved the problem by handling display: none for the parts that didn't apply, but it was a frustrating moment when a fatal error occurred that caused the page to crash. I once again confirmed that mobile devices are very sensitive to rendering optimization."
    },
    "kodex": {
      "title": "Samsung Asset Management",
      "desc": "The best data-driven rendering project ever",
      "awards": ["2023 A.N.D Award Grand Prix", "Web Award Korea 2023 Best Grand Prize😁"],
      "role": ["Front-end part leader"],
      "client": "Samsung Asset Management",
      "p01": "In order to connect with the backend team and meet customer requirements, React was used in the necessary parts in the form of a view library on top of Spring boot. <br />Except for simple post lists, all parts for data integration were handled with React.",
      "h01": "Main transition",
      "p02": "ETF/Fund is divided into two domains, so there are two main pages.",
      "p03": "To enable users to interactively move between two pages by clicking, the screen was switched using pushState, and the cards in Key Visual were classified according to the design guide.",
      "h02": "Product list parameters",
      "p04": "One of the key features of this project was to retrieve appropriate product data by calling numerous parameters through the API and elegantly render the product list.",
      "p05": "Filter properties were made into a common state to be shared between components, and in active, an advancement project, <strong>zustand and provider</strong> were used to make components render according to changes in the filter property bundle.",
      "p06": "Due to the tight schedule, we were unable to properly define the interface of the product model, so it was unfortunate that we were unable to take full advantage of typescript.",
      "h03": "Product component/template",
      "p07": "Another key feature, componentization/templating of product pages, also benefited from React's strong structural capabilities. I created about 20 components according to the previous screen design/design components and then combined them and rendered them according to the data and product type."
    },
    "casscool": {
      "title": "Cassool/World Cup",
      "desc": "Small but powerful mini project",
      "role": ["UI Development"],
      "client": "CASS",
      "h01": "On/offline events",
      "p01": "Beer brand Cass has created a mobile page for online and offline events. Since this was a project tailored to a designated offline event so tight, I used react to complete it quickly.",
      "p02": "It was easy to work with because it was a mobile-oriented page. It is a familiar work pattern that places UI on top of video elements, and was defined for ease of maintenance through layer placement."
    },
    "lotteshopping": {
      "title": "Lotte Shopping Web Main",
      "desc": "Stylish UI with vanilla state management",
      "role": ["Web main development"],
      "client": "Lotte Department Store",
      "h01": "Main state management",
      "p01": "The highly complex main page was processed without a separate library. Flexible view states were defined, such as being fixed when entering middle area, returning to page scrolling when objects scrolling backwards depending on the state.",
      "p02": "When entering the intermediate area, the state was managed stably through various variables such as timers and flags."
    },
    "hanwhadefense": {
      "title": "Hanwha Aerospace Virtual Showroom",
      "desc": "Handling WebGL 3D models",
      "awards": ["2023 A.N.D Award Minister of Science and ICT Award"],
      "role": ["Front-end part leader"],
      "client": "Hanwha Aerospace",
      "h01": "Handling WebGL 3D models",
      "p01": "I have often touched 3D models for personal work, but experiencing a full-scale practical project like this was a new experience.",
      "p02": "While the previous Hankook Tire 3D model was a relatively lightweight and simple model, this showroom had more models and the resulting requirements were a bit more complex, so there were more challenges than before.",
      "p03": "It was a fruitful project that allowed us to apply quite a variety of 3D technologies and UI techniques, such as split loading of assets, view switching, lighting, animation, and sprite processing, beyond point clicking and UI integration!"
    },
    "hankooktire": {
      "title": "Hankook Tire Global/Sales Platform",
      "desc": "Manage numerous components and templates",
      "awards": ["Web Award Korea 2022 Manufacturing Grand Prize", "2022 A.N.D Award Grand Prix", "iF DESIGN AWARD 2023 Winner", "Red Dot Design Award 2023 Winner"],
      "role": ["Front-end part leader"],
      "client": "Hankook Tire",
      "h01": "Hankook Tire Global/Sales Platform",
      "p01": "The Hankook Tire project was divided into a brand-centered global and product-centered sales platform, and was a large-scale project that took a long time and involved a lot of people.",
      "p02": "My roles and responsibilities in this project were to design AEM components to manage large amounts of pages, develop a front-end build system to build them, and recruit and train external personnel.",
      "p03": "Developing visual specialized pages such as Inside Hankook and technoring was also an essential role. I remember this project as being quite difficult as there were many quantitative and qualitative challenging moments.",
      "p04": "However, we designed a component system with minimal help from libraries and coordinated development by communicating with external partners. UI development External human resources team building and training. Aside from the awards, it was a project that achieved great results, including practical experience with WebGL.",
      "p05": "During operation, there was a CDN performance issue, which caused major problems for pages that used image sequences. CDN resource loading performance is a problem that cannot be solved in the frontend, but I came up with the idea to split the loading and treat it as complete when only 40% is loaded, and buy time for the rest to load while the user scrolls down. For the remaining 60%, the loading order was deemed important, so load promises were processed synchronously using a generator."
    },
    "iconic20": {
      "title": "Smilegate Iconic20",
      "desc": "Motion graphics-level visuals",
      "awards": ["2022 A.N.D Award Grand Prix"],
      "role": ["UI development"],
      "bracket": "(Currently, you may be redirected to the main page. Please go to the link one more time.🙏)",
      "client": "Smilegate",
      "h01": "Interactive Visuals",
      "p01": "I wasn't originally a TF at Smilegate, but when I saw the Iconic 20 page draft video, I had a desire to take on the challenge.<br /> This is because the distorted movement and presentation of the card required the use of WebGL and Shader, which was a milestone in the technology roadmap I drew.",
      "p02": "Since it was not a personal project, I checked the feasibility of the shader effect. After sharing it with the designer/planner, I received feedback that it would be a good idea to try it.",
      "p03": "I had a hard time with the layout due to the layout being tilted by about 20 degrees rather than the shader and distortion effects.",
      "p04": "It was not easy to move parts that would have been easy with an HTML structure to WebGL space, but I created a layout in HTML, imported it, converted it to the WebGL coordinate system, and placed card objects.",
      "p05": "When going to List - Details, calculating the card rotation was more difficult than I thought. Since the slanted part is based on the card list, the coordinates/tilt of the card and parent containers had to be taken into account for it to work as intended.",
      "p06": "As expected, going back from the details to the list was not easy. I had a hard time because the values I had to remember were very complicated. When the last algorithm was solved and everything was resolved, I was so happy that even though it was 3 a.m., I didn't immediately catch a taxi to go home and I remember dancing and walking along the Gyeongui Line forest path front of the office. :)"
    },
    "galaxystudio": {
      "title": "Samsung Galaxy Studio in my hand",
      "desc": "A tense but stable launch",
      "role": ["UI development"],
      "client": "Samsung"
    },
    "bespoke": {
      "title": "Samsung Bespoke, Be my own way",
      "desc": "Module Combination Micro UX",
      "role": ["UI development"],
      "client": "Samsung",
      "awards": ["Red Dot Design Award 2022"]
    },
    "kia-worldwide": {
      "title": "Kia Brand Global Showcase",
      "desc": "Kia’s transformational brand relaunch",
      "client": "Kia",
      "role": ["Front-end part leader"],
      "awards": ["Web Award Korea 2022 final winner😁"],
      "h01": "Brand Relaunch",
      "p01": "In 2021, Kia Motors changed its name to Kia and began a large-scale relaunch of the brand, including changes to CI and BI. During the materialization phase, a showcase website that dynamically displays content emerged as a requirement.",
      "p02": "The first page created was a page that showed a countdown until the time of the event D-day, and when the time was up, it converted to a showcase where you could view the content. All on one page.",
      "c01": "Particle motion was an unfortunate interaction that could only be seen for a moment as the event time passed.",
      "h02": "Particle Interaction",
      "p03": "When the event time comes and the content switches to a showcase, the circular object shows exploding particle motion. The motion of the circular object disappearing into particles meant that the circular object surrounding the existing Kia logo disappeared and a new logo was created. (Of course, that was not my intention.)",
      "p04": "Particle interaction is implemented with the canvas element. After testing to ensure comfortable motion even on older devices, the number of particles was set at 2000. When the time is up, they are randomly generated within a set range and then spread and disappear through simple physical calculations.",
      "p05": "Within the rendering loop, each particle has an each acceleration and mass for uniform rotational motion. Based on this updated value, the particles move little by little using the cos and sin functions. Adding a damping constant for deceleration to the acceleration results in plausible particle movement.",
      "p06": "Since then, pages have been added according to the event schedule, and the website showing Kia's brand concept has changed. It doesn't change dynamically like the previous page, though.",
      "p07": "Although the number of pages was small, there were a lot of design elements and motions and a lot of requirements, so it was a difficult project.",
      "p08": "While working on the brand slogan “movement that inspires,” I also prepared for a movement called job change to gain inspiration.",
      "p09": "Of course it's a joke haha :)"
    },
    "fujifilm": {
      "title": "Fujifilm",
      "desc": "Project where I applied the canvas element for the first time",
      "client": "Fujifilm",
      "role": ["UI development"]
    },
    "laneige": {
      "title": "Laneige",
      "desc": "Amore Pacific's global beauty website built in three languages",
      "client": "Amore Pacific",
      "role": ["UI development"],
      "strikeThrough": "(It has been renewed)"
    },
    "galleria": {
      "title": "Hanwha Galleria",
      "desc": "Massive integrated site and first PL role",
      "client": "Hanwha Galleria",
      "awards": ["Web Award Korea 2019 Grand Prize"],
      "role": ["UI development"]
    },
    "vyvydstudio": {
      "title": "VYVYD STUDIO",
      "desc": "Cosmetic brand for millennial insiders",
      "client": "Vyvydworks",
      "awards": ["Web Award Korea 2019 Grand Prize"],
      "role": ["UI development"],
      "strikeThrough": "(It's closed T.T)"
    },
    "continuous-award-winning": {
      "title": "Best Grand Prize for 2 consecutive years",
      "client": "Samsung Asset Management, Kia",
      "desc": "",
      "role": ["UI Development"],
      "p01": "The project which I’ve paticiparted and led won the final winners at Web Award Korea aka i-awards, one of Korea's most prestigious web awards, for consecutive years in 2022 and 2023!",
      "p02": "Samsung Fund was to show beautiful visualizations so many data using react. <br/> Kia Worldwide introduced a new concept design through the several front-end stack.",
      "p03": "I’m so lucky with incredible creative people! I would appreciate. 😄"
    }
  }
}
