export default function About() {
  return (
    <>
    <div className="max-w-3xl mr-auto ml-auto mt-64">
      <h1 className="text-7xl font-bold uppercase">About</h1>
      <hr />

      <h2 className="text-3xl mt-10">Who</h2>
      <p>
        지난 10여 년간 UI 프론트엔드 개발 분야에서 삼성, 현대, 기아와 같은 국내 대형 클라이언트의 웹 프로젝트들이 우수한 품질의 결과물로 현실화 되게 하는 것이 저의 책임이었습니다.
      </p>
      <p>
        
      </p>
      <br />
      <p>
        제가 속해있는 UI 프론트엔드 세계는 제가 커리어를 시작할 당시 RIA라는 이름으로 불리던 무렵부터 지금까지 정말 많은 변화가 소용돌이처럼 끊임없이 지나오고 있습니다.
      </p>
      <p>
        이 흥미로운 기술 세계에서 때로는 생존을 위해 과감히 가진 것을 버리고 최신 기술 스택을 지향하며 변화해 왔습니다. 가지고 있는 기술을 폐기하고 그 자리에 새로운 것들을 채워야 하는 그 과정은 매우 고통스러웠습니다.
      </p>
      <p>
        그러나 이 과정은 기술, 특히 UI/프론트엔드 파트가 어떤 라이브러리에도 종속적이지 않고 본질은 동일하다는 통찰을 얻게 하였습니다.
        스크린에 컴포넌트를 올리고 이를 여러 방향으로 연결시키고 그 상태를 관리하고 고수준 애니메이션이 필요하다면 렌더링 루프로 처리하는 등 이 모든 일이 같으며, 라이브러리는 이를 보다 효율적으로 만들어 주는 도구에 불과함을 알게 되었습니다.
      </p>
      <p>
        또 이런 프로젝트 여정 속에서 만난 사람들과 함께 문제를 고민하고 때로는 밤새 씨름하며 해결하면서 놀랍게도 열정적이고 단단하며 팀에 헌신적인 한 사람을 발견하게 되었습니다.
      </p>
      <br />
      <p>전 다음 부분에 남다른 강점이 있습니다.</p>
      <h3>UX Engineering</h3>
      <p>경험했던 부분들이 모션, 인터랙션, 3D 등 프리젠테이션 레이어에 좀 더 특화되어 있어 디자이너와 협업하는 것을 좋아하고 심미적으로 아름다운 어플리케이션 개발에 자신 있습니다.</p>
      <h3>Semi Full stack</h3>
      <p>데이터베이스 테이블을 설계하고 API를 만들어 서비스하며, 쌓여진 데이터를 통계 쿼리로 분석한 실무 경험은 업계가 요구하는 백엔드 엔지니어 만큼은 못되지만 웹의 전반적인 구조와 흐름을 알게 했으며 이는 제게 훌륭한 자산입니다. </p>
      <br />
      <p>
        지금은 주력으로 사용하는 리액트를 최적화하고 보다 빠르게 만들고자 고민하고 있으며, 
        더불어 당면한 AI 시대와 특히 다가올 공간 컴퓨팅 세상에 Web이 어떻게 표현될지 생각합니다.
      </p> 
      <br />
      <p>
        저에 대해 흥미로운 부분이 있다면 언제든지 연락해 주세요.
      </p>
      <p>
        새로운 아이디어에 기여할 준비가 되어 있습니다.
      </p>
      <p>
        무언가 멋진 것들을 함께 만들어 봅시다!
      </p>

      
      <h2 className="text-3xl mt-10">Experiences</h2>
      <div>- 2023</div>
      <div>- 2022</div>
      <div>...</div>


      <h2 className="text-3xl mt-10">Awards</h2>
      <div>- 2023</div>
      <div>i-awards final winner</div>
      <div>...</div>
    </div>
    </>
  )
}